## import Pandas library

In [42]:
import pandas as pd
import numpy as np

## Creating, Reading, Writing

In [43]:
# Dataframe - is table

df = pd.DataFrame({'openPrice':[34495],'lastPrice':[34691]}, index=['29th July'])
print(df)

# convert to CSV
df.to_csv('stockprice.csv')

titanic = pd.read_csv('titanic.csv')

stockprice = pd.read_csv('stockprice.csv', index_col=0)
stockprice

           openPrice  lastPrice
29th July      34495      34691

           openPrice  lastPrice
29th July      34495      34691

In [44]:
# Series - list
series = pd.Series(['hi','I am bob','i am introvert','very intriguing person'])
series

0                        hi
1                  I am bob
2            i am introvert
3    very intriguing person
dtype: object

In [45]:
# Reading Data
data = pd.read_csv('housing.csv')
print(data.head())
print(type(data))

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0    -122.23     37.88                41.0        880.0           129.0
1    -122.22     37.86                21.0       7099.0          1106.0
2    -122.24     37.85                52.0       1467.0           190.0
3    -122.25     37.85                52.0       1274.0           235.0
4    -122.25     37.85                52.0       1627.0           280.0

   population  households  median_income  median_house_value ocean_proximity
0       322.0       126.0         8.3252            452600.0        NEAR BAY
1      2401.0      1138.0         8.3014            358500.0        NEAR BAY
2       496.0       177.0         7.2574            352100.0        NEAR BAY
3       558.0       219.0         5.6431            341300.0        NEAR BAY
4       565.0       259.0         3.8462            342200.0        NEAR BAY
<class 'pandas.core.frame.DataFrame'>

In [46]:
longitude_series = pd.Series(data['longitude']);print(longitude_series)

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

## Indexing, Selecting, Assigning

In [47]:
# Indexing and selecting a key
print(data.latitude)
print(data.latitude[0])

0        37.88
1        37.86
2        37.85
3        37.85
4        37.85
         ...
20635    39.48
20636    39.49
20637    39.43
20638    39.43
20639    39.37
Name: latitude, Length: 20640, dtype: float64
37.88

In [48]:
# iloc - index based selection
# loc  - label based selection
data.iloc[0]

longitude              -122.23
latitude                 37.88
housing_median_age        41.0
total_rooms              880.0
total_bedrooms           129.0
population               322.0
households               126.0
median_income           8.3252
median_house_value    452600.0
ocean_proximity       NEAR BAY
Name: 0, dtype: object

In [49]:
data.iloc[:,1]

0        37.88
1        37.86
2        37.85
3        37.85
4        37.85
         ...
20635    39.48
20636    39.49
20637    39.43
20638    39.43
20639    39.37
Name: latitude, Length: 20640, dtype: float64

In [50]:
data.iloc[:3,0]

0   -122.23
1   -122.22
2   -122.24
Name: longitude, dtype: float64

In [51]:
data.iloc[[0,1], -1]

0    NEAR BAY
1    NEAR BAY
Name: ocean_proximity, dtype: object

In [52]:
data.loc[0,'latitude']

37.88

In [53]:
data.loc[:, ['longitude','latitude']]

       longitude  latitude
0        -122.23     37.88
1        -122.22     37.86
2        -122.24     37.85
3        -122.25     37.85
4        -122.25     37.85
...          ...       ...
20635    -121.09     39.48
20636    -121.21     39.49
20637    -121.22     39.43
20638    -121.32     39.43
20639    -121.24     39.37

[20640 rows x 2 columns]

In [54]:
"""iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the 
last one excluded. So 0:10 will select entries 0,...,9. loc, meanwhile, indexes inclusively. 
So 0:10 will select entries 0,...,10."""

# loc  - is used for the labeling indexing
# iloc - is used for the indexing (trough numerical list manulpulation)
print(data.loc[:3, ['longitude','latitude']])
print()
print(data.iloc[:3,0])

   longitude  latitude
0    -122.23     37.88
1    -122.22     37.86
2    -122.24     37.85
3    -122.25     37.85

0   -122.23
1   -122.22
2   -122.24
Name: longitude, dtype: float64

## Condition Selection

In [55]:
data.longitude == -122.23
print(data.loc[data.housing_median_age==52.0])
print(data.loc[data.ocean_proximity.isin(['NEAR BAY'])])
data.loc[data.longitude.notnull()]

       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
2        -122.24     37.85                52.0       1467.0           190.0
3        -122.25     37.85                52.0       1274.0           235.0
4        -122.25     37.85                52.0       1627.0           280.0
5        -122.25     37.85                52.0        919.0           213.0
6        -122.25     37.84                52.0       2535.0           489.0
...          ...       ...                 ...          ...             ...
20142    -119.06     34.36                52.0       1239.0           320.0
20220    -119.27     34.28                52.0       2239.0           420.0
20236    -119.27     34.27                52.0        459.0           112.0
20237    -119.27     34.27                52.0       1577.0           343.0
20592    -121.58     39.14                52.0        662.0           160.0

       population  households  median_income  median_house_value  \
2           496.0       177.0         7.2574            352100.0
3           558.0       219.0         5.6431            341300.0
4           565.0       259.0         3.8462            342200.0
5           413.0       193.0         4.0368            269700.0
6          1094.0       514.0         3.6591            299200.0
...           ...         ...            ...                 ...
20142       934.0       298.0         1.8618            183300.0
20220       941.0       397.0         4.1250            349000.0
20236       276.0       107.0         2.3750            198400.0
20237       836.0       335.0         3.5893            206600.0
20592       520.0       149.0         0.8928             55000.0

      ocean_proximity
2            NEAR BAY
3            NEAR BAY
4            NEAR BAY
5            NEAR BAY
6            NEAR BAY
...               ...
20142       <1H OCEAN
20220      NEAR OCEAN
20236      NEAR OCEAN
20237      NEAR OCEAN
20592          INLAND

[1273 rows x 10 columns]
       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0        -122.23     37.88                41.0        880.0           129.0
1        -122.22     37.86                21.0       7099.0          1106.0
2        -122.24     37.85                52.0       1467.0           190.0
3        -122.25     37.85                52.0       1274.0           235.0
4        -122.25     37.85                52.0       1627.0           280.0
...          ...       ...                 ...          ...             ...
19067    -122.45     38.28                20.0       3306.0           503.0
19068    -122.47     38.29                14.0       3732.0           846.0
19069    -122.45     38.27                25.0       5024.0           881.0
19077    -122.49     38.27                 8.0       5092.0           988.0
19104    -122.51     38.17                 8.0       5875.0          1115.0

       population  households  median_income  median_house_value  \
0           322.0       126.0         8.3252            452600.0
1          2401.0      1138.0         8.3014            358500.0
2           496.0       177.0         7.2574            352100.0
3           558.0       219.0         5.6431            341300.0
4           565.0       259.0         3.8462            342200.0
...           ...         ...            ...                 ...
19067      1374.0       460.0         5.7984            297600.0
19068      1277.0       775.0         2.5658            208000.0
19069      1994.0       838.0         4.2237            262300.0
19077      1657.0       936.0         3.5625            213200.0
19104      2808.0      1029.0         3.6392            246300.0

      ocean_proximity
0            NEAR BAY
1            NEAR BAY
2            NEAR BAY
3            NEAR BAY
4            NEAR BAY
...               ...
19067        NEAR BAY
19068        NEAR BAY
19069        NEAR BAY
19077        NEAR BAY
19104        NEAR BAY

[2290 rows x 10 columns]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

## Assigning

In [56]:
stockprice['lastPrice'] = 34691.50
stockprice

           openPrice  lastPrice
29th July      34495    34691.5

## SUMMARY FUNCTIONS AND MAP

In [57]:
data.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [58]:
data.longitude.describe()

count    20640.000000
mean      -119.569704
std          2.003532
min       -124.350000
25%       -121.800000
50%       -118.490000
75%       -118.010000
max       -114.310000
Name: longitude, dtype: float64

In [59]:
# unique values
data.ocean_proximity.unique()

array(['NEAR BAY', '<1H OCEAN', 'INLAND', 'NEAR OCEAN', 'ISLAND'],
      dtype=object)

In [60]:
data.longitude.mean()

-119.56970445736432

In [61]:
data.latitude.value_counts()

34.06    244
34.05    236
34.08    234
34.07    231
34.04    221
        ...
41.63      1
40.74      1
40.91      1
39.69      1
41.28      1
Name: latitude, Length: 862, dtype: int64

## Data Manipulation and Analysis

In [62]:
# head()

data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [63]:
# shape
data.shape

(20640, 10)

In [64]:
# columns
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [65]:
# info()
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [66]:
# isnull()
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [80]:
# drop()
# inplace is used to modify the current dataset
titanic.drop(['Parch'], axis = 1, inplace = True)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Cabin        204 non-null    object
 9   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 69.7+ KB

In [81]:
# describe()
titanic.describe()

       PassengerId    Survived         Age       SibSp        Fare
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838   28.765623    0.523008   32.204208
std     257.353842    0.486592   13.136649    1.102743   49.693429
min       1.000000    0.000000    0.420000    0.000000    0.000000
25%     223.500000    0.000000   22.000000    0.000000    7.910400
50%     446.000000    0.000000   25.000000    0.000000   14.454200
75%     668.500000    1.000000   35.000000    1.000000   31.000000
max     891.000000    1.000000   80.000000    8.000000  512.329200

In [82]:
# unique(), nunique()
print(titanic['Age'].nunique())
titanic['Age'].unique()

88

array([22.  , 38.  , 26.  , 35.  , 25.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  , 71.  ,
       37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 , 51.  ,
       55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  , 45.5 ,
       20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  , 60.  ,
       10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  , 70.  ,
       24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [83]:
# value_counts
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [84]:
# sample()
titanic.sample(2)

,PassengerId,Survived,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
554,555,1,"Ohman, Miss. Velin",female,22.0,0,347085,7.775,NaN,S
368,369,1,"Jermyn, Miss. Annie",female,25.0,0,14313,7.750,NaN,Q

In [85]:
# nsmallest, nlargest
print(titanic['Age'].nsmallest())
titanic['Age'].nlargest()

803    0.42
755    0.67
469    0.75
644    0.75
78     0.83
Name: Age, dtype: float64

630    80.0
851    74.0
96     71.0
493    71.0
116    70.5
Name: Age, dtype: float64

In [86]:
# Sorting - sort_index(), sort_values()

titanic[['PassengerId','Survived', 'Age', 'Fare']].sort_values(by = 'Age')

     PassengerId  Survived    Age     Fare
803          804         1   0.42   8.5167
755          756         1   0.67  14.5000
644          645         1   0.75  19.2583
469          470         1   0.75  19.2583
831          832         1   0.83  18.7500
..           ...       ...    ...      ...
116          117         0  70.50   7.7500
493          494         0  71.00  49.5042
96            97         0  71.00  34.6542
851          852         0  74.00   7.7750
630          631         1  80.00  30.0000

[891 rows x 4 columns]

In [87]:
# fillna()
titanic.fillna({'Age': 25}, inplace=True)
titanic.isnull().sum()

PassengerId      0
Survived         0
Name             0
Sex              0
Age              0
SibSp            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [88]:
# query()

titanic.query('40 < Age < 80').head(9)

,PassengerId,Survived,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
6,7,0,"McCarthy, Mr. Timothy J",male,54.0,0,17463,51.8625,E46,S
11,12,1,"Bonnell, Miss. Elizabeth",female,58.0,0,113783,26.5500,C103,S
15,16,1,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,248706,16.0000,NaN,S
33,34,0,"Wheadon, Mr. Edward H",male,66.0,0,C.A. 24579,10.5000,NaN,S
35,36,0,"Holverson, Mr. Alexander Oskar",male,42.0,1,113789,52.0000,NaN,S
52,53,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,PC 17572,76.7292,D33,C
54,55,0,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,113509,61.9792,B30,C
62,63,0,"Harris, Mr. Henry Birkhardt",male,45.0,1,36973,83.4750,C83,S
92,93,0,"Chaffee, Mr. Herbert Fuller",male,46.0,1,W.E.P. 5734,61.1750,E31,S

In [89]:
# duplicated(), drop_duplicated()

print(titanic.duplicated().sum())
titanic.duplicated()

0

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [90]:
# group_by()
titanic.groupby('Age').agg(np.mean)
titanic.groupby('Age').describe()

      PassengerId                                                          \
            count   mean         std    min     25%    50%     75%    max
Age
0.42          1.0  804.0         NaN  804.0  804.00  804.0  804.00  804.0
0.67          1.0  756.0         NaN  756.0  756.00  756.0  756.00  756.0
0.75          2.0  557.5  123.743687  470.0  513.75  557.5  601.25  645.0
0.83          2.0  455.5  532.451406   79.0  267.25  455.5  643.75  832.0
0.92          1.0  306.0         NaN  306.0  306.00  306.0  306.00  306.0
...           ...    ...         ...    ...     ...    ...     ...    ...
70.00         2.0  709.5   51.618795  673.0  691.25  709.5  727.75  746.0
70.50         1.0  117.0         NaN  117.0  117.00  117.0  117.00  117.0
71.00         2.0  295.5  280.721392   97.0  196.25  295.5  394.75  494.0
74.00         1.0  852.0         NaN  852.0  852.00  852.0  852.00  852.0
80.00         1.0  631.0         NaN  631.0  631.00  631.0  631.00  631.0

      Survived       ... SibSp       Fare                                 \
         count mean  ...   75%  max count      mean        std       min
Age                  ...
0.42       1.0  1.0  ...  0.00  0.0   1.0    8.5167        NaN    8.5167
0.67       1.0  1.0  ...  1.00  1.0   1.0   14.5000        NaN   14.5000
0.75       2.0  1.0  ...  2.00  2.0   2.0   19.2583   0.000000   19.2583
0.83       2.0  1.0  ...  0.75  1.0   2.0   23.8750   7.247845   18.7500
0.92       1.0  1.0  ...  1.00  1.0   1.0  151.5500        NaN  151.5500
...        ...  ...  ...   ...  ...   ...       ...        ...       ...
70.00      2.0  0.0  ...  0.75  1.0   2.0   40.7500  42.779960   10.5000
70.50      1.0  0.0  ...  0.00  0.0   1.0    7.7500        NaN    7.7500
71.00      2.0  0.0  ...  0.00  0.0   2.0   42.0792  10.500536   34.6542
74.00      1.0  0.0  ...  0.00  0.0   1.0    7.7750        NaN    7.7750
80.00      1.0  1.0  ...  0.00  0.0   1.0   30.0000        NaN   30.0000


            25%       50%       75%       max
Age
0.42     8.5167    8.5167    8.5167    8.5167
0.67    14.5000   14.5000   14.5000   14.5000
0.75    19.2583   19.2583   19.2583   19.2583
0.83    21.3125   23.8750   26.4375   29.0000
0.92   151.5500  151.5500  151.5500  151.5500
...         ...       ...       ...       ...
70.00   25.6250   40.7500   55.8750   71.0000
70.50    7.7500    7.7500    7.7500    7.7500
71.00   38.3667   42.0792   45.7917   49.5042
74.00    7.7750    7.7750    7.7750    7.7750
80.00   30.0000   30.0000   30.0000   30.0000

[88 rows x 32 columns]

In [101]:
# get_group()

titanic.groupby('Survived').get_group(1)

,PassengerId,Survived,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
8,9,1,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,347742,11.1333,NaN,S
9,10,1,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...
875,876,1,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,2667,7.2250,NaN,C
879,880,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,11767,83.1583,C50,C
880,881,1,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,230433,26.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C

In [138]:
# replace()
titanic['Cabin'].isnull().sum()
titanic.Cabin.fillna('UnKnown')
titanic.Cabin.replace(to_replace = dict(C123 = 'C1233'), inplace = True)
titanic['Cabin'].head()

0      NaN
1      C85
2      NaN
3    C1233
4      NaN
Name: Cabin, dtype: object

## Data Types

In [100]:
titanic.Survived.dtype

dtype('int64')

In [120]:
titanic['Age'].astype('int64')

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    25
889    26
890    32
Name: Age, Length: 891, dtype: int64

In [139]:
titanic.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C1233,S
4,5,0,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S